SM_для_EDT/src/Documents/впУчетНаработкиОборудования/впУчетНаработкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впУчетНаработкиОборудования</name>
  <registerRecords>InformationRegister.впНаработкаОбъектовРемонта</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаработкаОбъектов</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПоРемонту</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодчиненныеОбъекты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодчиненныйОбъект</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/впУчетНаработкиОборудования/ManagerModule.bsl
Функция ПодготовитьТаблицуДвижений(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	  Запрос.УстановитьПараметр("Ссылка", Ссылка);
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.ОбъектРемонта КАК ОбъектРемонта,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыПо КАК ДатаРаботыПо,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение КАК НовоеЗначение,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.НаработкаПоРемонту КАК НаработкаПоРемонту
	                 |ИЗ
	                 |	Документ.впУчетНаработкиОборудования.НаработкаОбъектов КАК впУчетНаработкиОборудованияНаработкаОбъектов
	                 |ГДЕ
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.Ссылка = &Ссылка
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	впУчетНаработкиОборудованияПодчиненныеОбъекты.ПодчиненныйОбъект,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.Показатель,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыПо,
	                 |	впУчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение,
	                 |	NULL
	                 |ИЗ
	                 |	Документ.впУчетНаработкиОборудования.НаработкаОбъектов КАК впУчетНаработкиОборудованияНаработкаОбъектов
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.впУчетНаработкиОборудования.ПодчиненныеОбъекты КАК впУчетНаработкиОборудованияПодчиненныеОбъекты
	                 |		ПО впУчетНаработкиОборудованияНаработкаОбъектов.Ссылка = впУчетНаработкиОборудованияПодчиненныеОбъекты.Ссылка
	                 |			И впУчетНаработкиОборудованияНаработкаОбъектов.ОбъектРемонта = впУчетНаработкиОборудованияПодчиненныеОбъекты.Объект
	                 |			И (впУчетНаработкиОборудованияНаработкаОбъектов.Ссылка = &Ссылка)";
	  
	  Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
